-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 16, 2024 at 04:31 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bookshop`
--

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `description` varchar(1500) NOT NULL,
  `cover` varchar(50) NOT NULL,
  `price` int(11) NOT NULL,
  `categories` varchar(100) NOT NULL DEFAULT 'همه',
  `author` varchar(50) NOT NULL,
  `download_link` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `title`, `description`, `cover`, `price`, `categories`, `author`, `download_link`) VALUES
(1, 'اثر مرکب', 'سرنوشت چیزی‌ست که خودتان آن را می‎‌سازید. اگر می‌خواهید جاده‌ی موفقیت را برای خود هموار کنید، کتاب اثر مرکب به قلم دارن هاردی می‌تواند راهگشای شما در این مسیر پرپیچ‌وخم باشد. این کتاب در ایران و کشورهای مختلف جهان با استقبال فراوانی از جانب مخاطبان روبه‌رو شده و یکی از پرفروش‌ترین‌های فهرست نیویورک تایمز و آمازون بوده است.\r\n\r\nهمه‌ی ما می‌دانیم که رسیدن به موفقیت، امری ناگهانی نیست و عوامل متعددی در تبدیل یک فرد عادی به یک انسان موفق دخیل هستند. کتاب اثر مرکب (The Compound Effect) برگرفته از تجربیات شخصی دارن هاردی (Darren Hardy) است. او سال‌ها جزو سرآمدان صنعت موفقیت و پیشرفت شخصی بوده، صدهاهزار دلار را صرف آزمودن ایده‌ها، منابع و فلسفه‌های مختلف کرده و درنهایت، ما‌حصل آن‌ها را در این اثر گنجانده است.\r\n\r\nما در طول روز شاهد تبلیغات وسوسه‌انگیزی هستیم که ادعا می‌کنند با تلاش کم و هزینه‌ی ناچیز، می‌توانید جوان‌تر، پولدارتر، لاغرتر و... شوید. اما واقعیت این است که هیچ موفقیتی بدون تلاش و هیچ تلاشی بدون داشتن برنامه‌ای منسجم، به نتیجه نخواهد رسید. درواقع ما ناگهانی ثروتمند نمی‌شویم، اما می‌توانیم راهکارهایی جهت ثروتمند شدن بیاموزیم و آن‌ها را به طور مداوم و دقیق جهت افزایش درآمد خود به کار ببریم. این مورد از نکات طلایی و واقعیت‌هایی‌ست که دارن هاردی آن‌ها را در کتاب اثر مرکب، سخاوتمندانه در اختیار طیف گسترده‌ای از مخاطبانش می‌گذارد.', 'images/the_compound_effect.png', 79900, 'همه,موفقیت و خودسازی', 'دارن هاردی', 'https://od.lk/d/M18zMDQ2NDgwMjBf/%D8%A7%D8%AB%D8%B1%20%D9%85%D8%B1%D9%83%D8%A8.pdf'),
(2, 'اساطیر یونان', 'اساطیر یونانی مجموعه اساطیر و آموزه‌هایی است که به یونان باستان مرتبط می‌باشد، دربارهٔ خدایان و قهرمانان آنان، طبیعت جهان و ریشه‌های آن و اهمیت مکتب و آیین آن‌ها سخن می‌گوید. این اسطوره‌شناسی بخشی از دین یونان باستان می‌باشد. محققان به منظور مشخص کردن تأثیرات دینی و سیاسی آن بر یونان باستان و تمدن آن و درک خود اسطوره‌سازی، اسطوره‌ها را بررسی می‌کنند.\r\nاساطیر یونانی به صراحت و به‌طور گسترده در مجموعه‌ای از داستان‌ها و به‌طور ضمنی در آثار هنری یونانی مانند گلدان‌های نقاشی و هدایای وتیو نمود یافته‌است. اسطوره‌های یونانی می‌کوشند منشأ جهان را توصیف کنند، و جزئیات زندگی‌ها و ماجراهای طیف گسترده‌ای از خدایان، الهه‌ها، قهرمانان، پهلوانان و موجودات اساطیری را بیان می‌نماید. این حساب‌ها در ابتدا در یک سنت شفاهی درج شدند؛ امروزه اساطیر یونانی در درجه اول از ادبیات یونانی معلوم می‌شوند. قدیمی‌ترین منابع ادبی یونان، یعنی اشعار حماسی ایلیاد و ادیسه هومر، بر روی جنگ تروآ و اتفاقات بعدی آن تمرکز کرده‌اند. هزیود، شاعر معاصر هومر، دو اثر به نام‌های تئوگونیا و کارها و روزها نوشته‌است، که دربارهٔ پیدایش جهان، جانشینی قوانین الهی، جانشینی نسل‌های بشر، ریشه مشکلات انسان و ریشه کارهای فداکارانه سخن می‌گوید. همچنین اساطیر در سرودهای هومری، در قطعات اشعار حماسی از چرخه حماسی، در اشعار غنایی، در کارهای تراژیک قرن پنجم قبل از میلاد، در آثار محققان و شاعران عصر هلنیستی، و در متون امپراتوری روم نوشته شده به دست پلوتارک و پوسانیاس دیده می‌شود.\r\nکتاب شناخت اساطیر یونان توسعه و اهمیت اجتماعی اسطوره را در جامعه یونانی علاوه بر توصیف بهره‌برداری‌ها و ویژگی‌های فیزیکی خدایان و قهرمانان منفرد تحلیل می‌کند.', 'images/greek_mythology.png', 285000, 'همه,اساطیر,علمی', 'جان پینسنت', 'https://od.lk/d/M18zMDQ2NDgyMDRf/%D8%A7%D8%B3%D8%A7%D8%B7%DB%8C%D8%B1%20%DB%8C%D9%88%D9%86%D8%A7%D9%86%20%28%40ocbooks%29.pdf'),
(3, 'دو قرن سکوت', 'کتاب دو قرن سکوت نوشته عبدالحسین زرین‌کوب روایت سرگذشت ایرانیان پس از حمله اعراب در صدر اسلام است. دو قرن سکوت گزارشی است از دو صده سکوت ادبی، هنری و فلسفی ایرانیان پس از ورود اسلام.\r\nکتاب دو قرن سکوت نخستین بار در نشریه «مهرگان» به صورت پاورقی چاپ شد و سپس در سال ۱۳۳۰ به صورت یک کتاب کامل منتشر شد. این کتاب با سرعت فروش رفت و در بازار کتاب نایاب شد اما عبدالحسین زرین‌کوب به چاپ مجدد کتاب رضایت نداد و اعلام کرد قصد دارد کتاب را برای چاپ‌ها بعدی بازنویسی کند. سرانجام پس از پنج سال بررسی منابع متعدد در سال ۱۳۳۶ متن کامل‌تر و جامع‌تری را در انتشارات امیرکبیر چاپ کرد. او در مقدمه این ویرایش دوم به برخی از انتقادات بر کتاب اول پاسخ داد و آن را ناشی از جوانی و تعصب خود دانست.', 'images/two_centuries_of_silence.png', 42500, 'همه,تاریخی', 'عبدالحسین زرین‌کوب', 'https://od.lk/d/M18zMDQ2NDc0MTBf/%D8%AF%D9%88%20%D9%82%D8%B1%D9%86%20%D8%B3%DA%A9%D9%88%D8%AA.pdf'),
(4, 'روان درمانی اگزیستانسیال', 'مفاهیم وجودی انسان همیشه دست‌مایه‌ی خلق آثار بزرگ و شگفت‌آور در طول تاریخ بوده که بسیاری از نظریات و تفکرات حاکم پس از خود را تحت تأثیر قرار داده است. افراد زیادی طی سال‌های اخیر همانند فلاسفه‌ی باستانی این مضامین را به چالش کشیده‌اند و کتاب‌های قابل‌توجهی را منتشر کرده‌اند. «اروین یالوم» موضوعات مرتبط با سرشت و غایت انسان را در میان آثاری درمانی داستانی به تصویر می‌کشد و اثری روان‌شناسانه و فلسفی در قالب رمان می‌آفریند. کتاب «روان‌درمانی اگزیستانسیال وجودی» یکی از آثار ویژه و شاخص این نویسنده است که درباره‌ی چهار دغدغه‌ی غایی زندگی، مرگ، آزادی، انزوای اگزیستانسیال و بی‌معنایی است. این کتاب جریانی روشن و بسیار تأثیرگذار است که سایت پرطرفدار گودریدز درباره‌ی آن نوشت: «اثری استادانه و مبتکرانه.»', 'images/existential_psychotherapy.png', 251000, 'همه,روانشناسی', 'اروین یالوم', 'https://od.lk/d/M18zMDQ2NDc3NDhf/ExistentialPsychotherpybook.pdf'),
(5, 'کتاب 33 استراتژی جنگ', 'بدون تردید راهکارهای مطرح‌شده در کتاب 33 استراتژی جنگ (The 33 Strategies of War) برای کسانی که در پی کسب موفقیت در تمام حوزه‌های زندگی ازجمله کسب‌وکار، روابط اجتماعی و زندگی شخصی خود هستند، کارساز خواهد بود. کافی‌ست دستورالعمل‌های رابرت گرین (Robert Greene) در این کتاب را به‌کار ببندید تا بر رقبای خود پیروز شوید. زندگی روزمره و دنیای کسب‌وکار شباهت بسیار زیادی با میدان نبرد دارد؛ فضایی که در آن هر کدام از طرفین برای کسب منافع شخصی بیشتر، به رقابت و مبارزه‌ی جدی با یکدیگر می‌پردازند.\r\n\r\nکتاب 33 استراتژی جنگ که پرفروش‌ترین کتاب سایت آمازون در دسته‌ی تاریخچه‌ی علوم نظامی محسوب می‌شود، ذهن شما را تربیت می‌کند تا با توجه به شرایط خود و دشمن یا حریفتان، کارآمدترین استراتژی را انتخاب کرده و با کم‌ترین تلفات و خسارات به بزرگ‌ترین پیروزی‌ها برسید. این اثر از رابرت گرین، عصاره و جوهره‌ی خرد بی‌انتهای نهفته در اصول و تعلیمات مربوط به شیوه‌های جنگ در طول تاریخ است. کتاب حاضر با این هدف تدوین شده که شما را به دانشی عملی مجهز سازد. نویسنده گزینه‌ها و مزایایی بی‌پایان برای دست‌وپنجه نرم کردن با جنگجویانی که هر روز با آن‌ها مواجه می‌شوید را به شما ارائه می‌دهد.', 'images/the_33_strategies_of_war.png', 119900, 'همه,روانشناسی,موفقیت و خودسازی', 'رابرت گرین', 'https://od.lk/d/M18zMDQ2NDc2ODRf/%DA%A9%D8%AA%D8%A7%D8%A8-33-%D8%A7%D8%B3%D8%AA%D8%B1%D8%A7%D8%AA%DA%98%DB%8C-%D8%AC%D9%86%DA%AF-olunot.pdf'),
(6, 'هنر اغواگری', 'هنر اغواگری را می‌توان با چند قانون مهم و اساسی آموخت. در کتاب مدرن و مبتکرانه‌ی هنر اغواگری (The Art Of Seduction)، راهکار‌هایی ارائه می‌شود که پس از بکارگیری آن‌ها قادر خواهید بود همه‌ی افراد و عواملی را که به تحقق هدف‌هایتان منجر می‎شود به خدمت خود درآورید. رابرت گرین (Robert Greene) با ارجاع به شخصیت‌های تاریخی بسیاری مانند جان‌ اف کندی، اندی وارهول، ژوزفین بناپارت، فروید و انیشتن، شیوه‌های جذب و افسونگری را گام‌به‌گام به ما می‌آموزد. آشنایی با روش و منش شخصیت‌های تأثیرگذار تاریخ، بهترین راه برای یادگیری قدرت جذب است چراکه آن‌ها زیرکانه از فوت‌وفن اغواگری بهره می‌بردند تا خواسته‌های بلندپروازانه‌ی خود را عملی کنند.', 'images/the_art_seduction.png', 98000, 'همه,موفقیت و خودسازی,روانشناسی', 'رابرت گرین', 'https://od.lk/d/M18zMDQ2NDc3NzVf/%D9%87%D9%86%D8%B1%20%D8%A7%D8%BA%D9%88%D8%A7%DA%AF%D8%B1%DB%8C%20%28%40ocbooks%29.pdf'),
(7, 'جرات داشته باش', 'ممکن است شما هم هنگام انجام کارهای کوچک یا بزرگ احساس کنید که نمی‌توانید یا این‌که از پس انجام دادن آن کار برنمی‌آیید. نگران نباشید این حسی مشترک میان، تقریبا تمام مراجعین دکتر فانژه است؛ درواقع این حس مشترک دلیل نوشتن این کتاب است.\r\nفردریک فانژه در کتاب جرات داشته باش، کاربردی‌ترین روش‌ها را برای درمان کمبود اعتماد به نفس به شما اریه می‌دهد. فردریک فانژه خواندن این کتاب را به همه‌ی انسان‌های روی زمین پیش‌نهاد کرده است.', 'images/therapie_de_la_confiance.png', 116000, 'همه,موفقیت و خودسازی', 'فردریک فانژه', 'https://od.lk/d/M18zMDQ2NDgwMzJf/%D8%AC%D8%B1%D8%A3%D8%AA%20%D8%AF%D8%A7%D8%B4%D8%AA%D9%87%20%D8%A8%D8%A7%D8%B4.pdf'),
(8, 'هر دو در نهایت می‌میرند', 'آدام سیلورا، نویسنده‌ی برجسته‌ی آمریکایی در رمان هر دو در نهایت می‌میرند داستان دو پسر نوجوان به نام‌های تیو تورِز و رفوس اِمتریو را روایت می‌کند که متوجه شده‌اند تنها یک روز به پایان زندگی‌شان باقی است. اکنون آن دو باید خود انتخاب کنند که چگونه آخرین روز را سپری کنند. انتخاب آن دو یک چیز است: گذراندن روز آخر با یک دوست. خوشبختانه نرم‌افزار «آخرین دوست» به روز‌آخری‌ها کمک می‌کند یکدیگر را پیدا کنند. این کتاب از برندگان جایزه‌ی لینکلن بوده است.', 'images/they_both_die_at_the_end.png', 59000, 'همه,داستان', 'آدام سیلورا', 'https://od.lk/d/M18zMDQ2NDc5ODJf/%E2%80%8E%E2%81%A8%D9%87%D8%B1_%D8%AF%D9%88_%D8%AF%D8%B1_%D9%86%D9%87%D8%A7%DB%8C%D8%AA_%D9%85%DB%8C%E2%80%8C%D9%85%DB%8C%D8%B1%D9%86%D8%AF%E2%81%A9_%40ocbooks.pdf'),
(9, 'قدرت شروع ناقص', 'زمانی که یک حرفه، هنر یا ورزش را به‌تازگی آغاز می‌کنید، خودتان را با چه کسی مقایسه خواهید کرد؟ در دسترس‌ترین گزینه‌ها، معمولاً افراد موفق حوزه‌ای هستند که تصمیم داریم به آن وارد شویم؛ آدم‌هایی که بعد از سال‌ها کوشش و خطا توانسته‌اند راهکارهایی دقیق و تضمینی برای پیش بردن امور پیدا کنند. در این شرایط ما سعی می‌کنیم به آن‌ها نگاه کنیم، خاطرات و تجربیاتشان را بخوانیم، پای حرف آن‌ها بنشینیم و قدم به قدم مسیرشان را تکرار کنیم. اما آیا این چیزی است که واقعاً به آن نیاز داریم؟ پاسخ جیمز کلیر (James Clear)، نویسنده و سخنران حوزه‌ی موفقیت، به این پرسش منفی است. او در کتاب قدرت شروع ناقص (The Power of Imperfect Starts)، دلایل این ادعای خود را به‌تفصیل توضیح می‌دهد.', 'images/the_power_of_imperfect_starts.png', 65000, 'همه,موفقیت و خودسازی', 'جیمز کلیر', 'https://od.lk/d/M18zMDQ2NDc5NDlf/%D9%82%D8%AF%D8%B1%D8%AA%20%D8%B4%D8%B1%D9%88%D8%B9%20%D9%86%D8%A7%D9%82%D8%B5%20%28%40ocbooks%29.pdf'),
(10, 'کورالاین', 'اگر در دنیای موازی با پدر و مادرتان ملاقات کنید، چه حسی خواهید داشت؟! نیل گیمن نویسنده‌ی پرفروش نیویورک تایمز با نوشتن کتاب کورالاین ما را با ماجراهای هیجان‌انگیز و ترسناک دخترکی همراه می‌کند که با کشف راز اتاق مهمان به دنیای جدیدی وارد می‌شود. آن هم به کمک یک سنگ سوراخ و گربه‌ای خنگ! کتاب کورالاین برنده‌ی جوایز مختلفی همچون جایزه‌ی هوگو شده است.', 'images/coraline.png', 112000, 'همه,داستان', 'نیل گیمن', 'https://od.lk/d/M18zMDQ2NDgyNjdf/%40baqvahm%20%20Coraline.pdf'),
(11, 'برادران کارامازوف', 'در کتاب برادران کارامازوف: جلد اول، یکی از مهم‌ترین آثار تاریخ ادبیات جهان، فئودور داستایوفسکی داستان چهار برادر را روایت می‌کند که هر یک بنا به انگیزه‌هایی شخصی در پی کشتن پدرشان هستند. در خلال این داستان است که داستایوفسکی مفاهیمی فلسفی را در حوزه‌ی الهیات و اخلاقیات مطرح می‌کند. این کتاب در دو جلد منتشر شده است و کتاب حاضر جلد نخست آن است.', 'images/the_brothers_karamazov.png', 617000, 'همه,داستان', 'فئودور داستایوفسکی', 'https://od.lk/d/M18zMDQ2NDgyNjFf/%D8%A8%D8%B1%D8%A7%D8%AF%D8%B1%D8%A7%D9%86%20%DA%A9%D8%A7%D8%B1%D8%A7%D9%85%D8%A7%D8%B2%D9%88%D9%81.pdf'),
(12, 'بازی تاج و تخت (طوفان شمشیرها)', 'کتاب طوفان شمشیرها (مجموعه نغمه آتش و یخ) جلد سوم از این مجموعه‌ی پرمخاطب و جذاب است که روایت‌گر رقابت و جدالِ پادشاهان و اشراف برای حفظ قدرت در قلمروی خیالی وستروس است. انتشار این کتاب باعث شد تا نام نویسنده‌ی آن، جرج آر. آر. مارتین به عنوان مؤلف آثار حماسی و کلاسیک مطرح شود و همچنین الهام‌بخشِ تولید سریالی تلویزیونی شد که توسط میلیون‌ها نفر در سراسر جهان دیده شده و به جوایز متعددی نیز دست یافته است.', 'images/game_of_thrones_a_storm_of_swords.png', 695000, 'همه,داستان', ' جرج آر آر مارتین', 'https://od.lk/d/M18zMDQ2NDgzMDhf/A-Storm-of-Swords3%40baqvahm.pdf'),
(13, 'ارباب حلقه ها (دو برج)', 'کتاب دو برج (The Two Towers) دومین جلد از سه‌گانه‌ی ارباب حلقه‌ها (The Lord of The Ring) نوشته‌ی جی. آر. آر. تالکین (J. R. R. Tolkien) است. تالکین نویسنده‌ای است که در نوشتن رمان‌های تخیلی و اساطیری، مهارتی فوق‌العاده دارد و هر کدام از رمان‌هایش در دنیایی خیالی اتفاق می‌افتند که کاملا ساخته‌ی ذهن اوست. تالکین عنوان کتاب را به شکلی مبهم انتخاب کرده است. او در داستان از پنج برج نام می‌برد، در صورتی که نام کتاب، دو برج است. روایت داستان نیز در این مجلد درهم‌آمیخته است و به تالکین امکان می‌دهد تا تعلیق بسازد و خوانندگان را دچار شگفتی کند. او در این جلد، روایت حماسی را با داستان‌های عاشقانه ترکیب کرده است.', 'images/the_lord_of_the_rings_the_two_towers.png', 750000, 'همه,داستان', 'جی. آر. آر. تالکین', 'https://od.lk/d/M18zMDQ2NDc1MjJf/%D8%A7%D8%B1%D8%A8%D8%A7%D8%A8%20%D8%AD%D9%84%D9%82%D9%87%20%D9%87%D8%A7%202.pdf'),
(14, 'ارباب حلقه ها (بازگشت پادشاه)', 'کتاب بازگشت پادشاه، جلد سوم ارباب حلقه‌ها از مجموعۀ خداوند انگشتری، بزرگترین حماسه‌ی خیالی، تألیف نویسنده‌ی شهیر انگلیسی، آقای جان رونالد روئل تالکین است.\r\nخداوند انگشتری (The Lord of The Rings) داستانی است برای تمام زمان‌ها؛ داستانی در مورد حس نیرومند قدرت‌پرستی و نتیجتاً فساد روح انسانی از یک طرف و عشق و نیاز به آزادی، تنها دو حس برتر، از سوی دیگر.', 'images/the_return_of_the_king.png', 810000, 'همه,داستان', 'جی. آر. آر. تالکین', 'https://od.lk/d/M18zMDQ2NDc1Mzlf/%D8%A7%D8%B1%D8%A8%D8%A7%D8%A8%20%D8%AD%D9%84%D9%82%D9%87%20%D9%87%D8%A7%203.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` varchar(50) NOT NULL,
  `title` varchar(50) NOT NULL,
  `image_src` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `title`, `image_src`) VALUES
('all', 'همه', 'images/icons/all.png'),
('economy', 'اقتصادی', 'images/icons/economy.png'),
('history', 'تاریخی', 'images/icons/history.png'),
('myth', 'اساطیر', 'images/icons/myth.png'),
('politic', 'سیاسی', 'images/icons/politic.png'),
('psychology', 'روانشناسی', 'images/icons/psychology.png'),
('science', 'علمی', 'images/icons/science.png'),
('self_improvement', 'موفقیت و خودسازی', 'images/icons/self_improvement.png'),
('story', 'داستان', 'images/icons/story.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
